{
    "E001" : "E001: The note name you have specified is 'illegal'. Please check it is formatted correctly.",
    "E002" : "E002: A note with this name already exists. (This error shouldn't trigger because the names are now UUID)",
    "E003" : "E003: The note could not be created. If you are running this instance of Notely locally please check the server console.",
    "E004" : "E004: You do not own the specified note.",
    "E005" : "E005: No note with the specified name exists.",
    "E006" : "E006: The note could not be saved. If you are running this instance of Notely locally please check the server console.",
    "E007" : "E007: The note could not be loaded. If you are running this instance of Notely locally please check the server console.",
    "E008" : "E008: The note could not be deleted. If you are running this instance of Notely locally please check the server console.",
    "E009" : "E009: The tag could not be added. If you are running this instance of Notely locally please check the server console.",
    "E010" : "E010: The tags could not be loaded. If you are running this instance of Notely locally please check the server console.",
    "E011" : "E011: The tag could not be removed. If you are running this instance of Notely locally please check the server console.",
    "E012" : "E012: Account with this email does not exist. Please create a new account.",
    "E013" : "E013: Login was unsuccessful. Please check you have entered your password correcty.",
    "E014" : "E014: Account with this email already exists. Please login instead.",
    "E015" : "E015: The email provided is 'illegal'. Please make sure you have entered a valid email (example@example.com).",
    "E016" : "E016: The password provided is 'illegal'. Please make sure you have entered a valid password.",
    "E017" : "E017: The account could not be created. If you are running this instance of Notely locally please check the server console.",
    "E018" : "E018: An account is required when using the official NOTELY site. If this is a locally hosted instance please check the localhost guide on Github.",
    "E019" : "E019: The notes could not be loaded. If you are running this instance of Notely locally please check the server console.",
    "E020" : "E020: Please fill out the Captcha.",
    "E021" : "E021: Unable to verify captcha.",
    "E022" : "E022: Logout failed. Usually this is caused by the user not being signed in to begin with.",
    "W001" : "W001: No note is currently loaded.",
    "I001" : "I001: The note was created successfully.",
    "I002" : "I002: The note was saved successfully.",
    "I003" : "I003: The note was deleted successfully.",
    "I004" : "I004: The tag was added successfully.",
    "I005" : "I005: The tag was removed successfully.",
    "I006" : "I006: Account was logged in successfully.",
    "I007" : "I007: Account was created successfully.",
    "I008" : "I008: Account was logged out successfully. We reccomend closing this tab."
}